-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2025-11-19 02:41:01
-- サーバのバージョン： 10.4.32-MariaDB
-- PHP のバージョン: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `salesdb`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `units`
--

CREATE TABLE `units` (
  `id` int(11) NOT NULL,
  `variety` varchar(32) NOT NULL COMMENT '商品品種',
  `unit` varchar(32) NOT NULL COMMENT '販売単位'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='単位';

--
-- テーブルのデータのダンプ `units`
--

INSERT INTO `units` (`id`, `variety`, `unit`) VALUES
(2, 'あさり', '個'),
(3, 'あじ', '個'),
(4, 'いか', '個'),
(5, 'いちご', '個'),
(6, 'いわし', '個'),
(7, 'うなぎのかば焼き', '個'),
(8, 'えのきたけ', '個'),
(9, 'えび', '個'),
(10, 'おにぎり・その他', '個'),
(11, 'かき(貝)', '個'),
(12, 'かつお', '個'),
(13, 'かつお節・削り節', '個'),
(14, 'かに', '個'),
(15, 'かぼちゃ', '個'),
(16, 'かまぼこ', '個'),
(17, 'かれい', '個'),
(18, 'きゅうり', '個'),
(19, 'ぎょうざ', '個'),
(20, 'こんにゃく', '個'),
(21, 'こんぶ', '個'),
(22, 'こんぶつくだ煮', '個'),
(23, 'ごぼう', '個'),
(24, 'さけ', '個'),
(25, 'さしみ盛合わせ', '個'),
(26, 'さつまいも', '個'),
(27, 'さといも', '個'),
(28, 'さば', '個'),
(29, 'さやまめ', '個'),
(30, 'さんま', '個'),
(31, 'しじみ', '個'),
(32, 'しめじ', '個'),
(33, 'しゅうまい', '個'),
(34, 'しょう油', '個'),
(35, 'しらす干し', '個'),
(36, 'じゃがいも', '個'),
(37, 'すいか', '個'),
(38, 'すし(外食)', '個'),
(39, 'すし(弁当)', '個'),
(40, 'せんべい', '個'),
(41, 'そうざい材料セット', '個'),
(42, 'たい', '個'),
(43, 'たけのこ', '個'),
(44, 'たこ', '個'),
(45, 'たまねぎ', '個'),
(46, 'たらこ', '個'),
(47, 'たんす', '百円'),
(48, 'だいこん', '個'),
(49, 'だいこん漬', '個'),
(50, 'ちくわ', '個'),
(51, 'つゆ・たれ', '個'),
(52, 'なす', '個'),
(53, 'にんじん', '個'),
(54, 'ねぎ', '個'),
(55, 'はくさい', '個'),
(56, 'はくさい漬', '個'),
(57, 'ふりかけ', '個'),
(58, 'ぶどう', '個'),
(59, 'ぶり', '個'),
(60, 'ほうれんそう', '個'),
(61, 'ほたて貝', '個'),
(62, 'まぐろ', '個'),
(63, 'まんじゅう', '個'),
(64, 'みかん', '個'),
(65, 'みそ', '個'),
(66, 'もち', '個'),
(67, 'もやし', '個'),
(68, 'やきとり', '個'),
(69, 'ようかん', '個'),
(70, 'りんご', '個'),
(71, 'れんこん', '個'),
(72, 'わかめ', '個'),
(73, 'アイスクリーム・シャーベット', '個'),
(74, 'ウイスキー', '個'),
(75, 'エアコンディショナ', '百円'),
(76, 'オレンジ', '個'),
(77, 'カステラ', '個'),
(78, 'カップ麺', '個'),
(79, 'カツレツ', '個'),
(80, 'カレールウ', '個'),
(81, 'カーテン', '百円'),
(82, 'キウイフルーツ', '個'),
(83, 'キャベツ', '個'),
(84, 'キャンデー', '個'),
(85, 'グレープフルーツ', '個'),
(86, 'ケチャップ', '個'),
(87, 'ケーキ', '個'),
(88, 'ココア・ココア飲料', '個'),
(89, 'コロッケ', '個'),
(90, 'コーヒー', '個'),
(91, 'コーヒー飲料', '個'),
(92, 'サラダ', '個'),
(93, 'ジャム', '個'),
(94, 'ストーブ・温風ヒーター', '百円'),
(95, 'スナック菓子', '個'),
(96, 'スパゲッティ', '個'),
(97, 'スポーツドリンク', '個'),
(98, 'ゼリー', '個'),
(99, 'ソース', '個'),
(100, 'ソーセージ', '個'),
(101, 'タオル', '個'),
(102, 'チューハイ・カクテル', '個'),
(103, 'チョコレート', '個'),
(104, 'チョコレート菓子', '個'),
(105, 'チーズ', '個'),
(106, 'ティッシュペーパー', '個'),
(107, 'トイレットペーパー', '個'),
(108, 'トマト', '個'),
(109, 'ドレッシング', '個'),
(110, 'ハム', '個'),
(111, 'ハンバーガー', '個'),
(112, 'ハンバーグ', '個'),
(113, 'バター', '個'),
(114, 'バナナ', '個'),
(115, 'ビスケット', '個'),
(116, 'ビール', '個'),
(117, 'ピーマン', '個'),
(118, 'ブロッコリー', '個'),
(119, 'プリン', '個'),
(120, 'ベッド', '百円'),
(121, 'ベーコン', '個'),
(122, 'ポリ袋・ラップ', '個'),
(123, 'マヨネーズ・マヨネーズ風調味料', '個'),
(124, 'マーガリン', '個'),
(125, 'ミネラルウォーター', '個'),
(126, 'メロン', '個'),
(127, 'ヨーグルト', '個'),
(128, 'レタス', '個'),
(129, 'ワイン', '個'),
(130, '中華そば', '個'),
(131, '中華食', '個'),
(132, '中華麺', '個'),
(133, '乳酸菌飲料', '個'),
(134, '乳飲料', '個'),
(135, '乾うどん・そば', '個'),
(136, '乾燥スープ', '個'),
(137, '他のきのこ(2014年までは26B,26Xを含む)', '個'),
(138, '他のパン', '個'),
(139, '他の主食的外食', '個'),
(140, '他の主食的調理食品', '個'),
(141, '他の乳製品', '個'),
(142, '他の乾物・海藻', '個'),
(143, '他の冷暖房用器具', '百円'),
(144, '他の加工肉', '個'),
(145, '他の台所用品', '個'),
(146, '他の和生菓子', '個'),
(147, '他の塩干魚介', '個'),
(148, '他の大豆製品', '個'),
(149, '他の室内装備品', '百円'),
(150, '他の家事用消耗品のその他(2014年までは536,537を含む)', '百円'),
(151, '他の家事用耐久財', '百円'),
(152, '他の家事雑貨', '百円'),
(153, '他の家具', '百円'),
(154, '他の寝具類', '百円'),
(155, '他の果物', '個'),
(156, '他の柑きつ類', '個'),
(157, '他の根菜', '個'),
(158, '他の洋生菓子', '個'),
(159, '他の生鮮肉', '個'),
(160, '他の穀類のその他', '個'),
(161, '他の茶葉', '個'),
(162, '他の菓子', '個'),
(163, '他の葉茎菜', '個'),
(164, '他の調味料', '個'),
(165, '他の調理食品のその他', '個'),
(166, '他の貝', '個'),
(167, '他の酒(2014年までは3X8を含む)', '個'),
(168, '他の野菜のその他', '個'),
(169, '他の野菜の漬物', '個'),
(170, '他の野菜・海藻のつくだ煮', '個'),
(171, '他の野菜・海藻加工品のその他', '個'),
(172, '他の食卓用品', '百円'),
(173, '他の飲料のその他(2014年までは38Yを含む)', '個'),
(174, '他の魚介加工品のその他', '個'),
(175, '他の魚肉練製品', '個'),
(176, '他の鮮魚', '個'),
(177, '他の麺類', '個'),
(178, '他の麺類外食', '個'),
(179, '冷凍調理食品', '個'),
(180, '即席麺', '個'),
(181, '卵', '個'),
(182, '台所・住居用洗剤', '個'),
(183, '合いびき肉', '個'),
(184, '和食', '個'),
(185, '喫茶代', '個'),
(186, '塩さけ', '個'),
(187, '天ぷら・フライ', '個'),
(188, '学校給食', '個'),
(189, '室内装飾品', '百円'),
(190, '家事代行料', '百円'),
(191, '家具・家事用品関連サービス', '件'),
(192, '小麦粉', '個'),
(193, '布団', '百円'),
(194, '干しあじ', '個'),
(195, '干ししいたけ', '個'),
(196, '干しのり', '個'),
(197, '弁当', '個'),
(198, '応接セット', '百円'),
(199, '揚げかまぼこ', '個'),
(200, '敷布', '百円'),
(201, '敷物', '百円'),
(202, '日本そば・うどん', '個'),
(203, '果実・野菜ジュース', '個'),
(204, '果物加工品', '個'),
(205, '柔軟仕上剤', '個'),
(206, '柿', '個'),
(207, '桃', '個'),
(208, '梅干し', '個'),
(209, '梨', '個'),
(210, '殺虫・防虫剤', '個'),
(211, '毛布', '百円'),
(212, '油揚げ・がんもどき', '個'),
(213, '洋食(2014年までは399を含む)', '個'),
(214, '洗濯用洗剤', '個'),
(215, '清掃代', '百円'),
(216, '清酒', '個'),
(217, '炊事用ガス器具', '百円'),
(218, '炊事用電気器具', '百円'),
(219, '炭酸飲料', '個'),
(220, '焼肉', '個'),
(221, '焼酎', '個'),
(222, '照明器具', '百円'),
(223, '牛乳', '個'),
(224, '牛肉', '個'),
(225, '生うどん・そば', '個'),
(226, '生しいたけ', '個'),
(227, '発泡酒・ビール風アルコール飲料', '個'),
(228, '砂糖', '個'),
(229, '米', '個'),
(230, '粉ミルク', '個'),
(231, '紅茶', '個'),
(232, '納豆', '個'),
(233, '緑茶', '個'),
(234, '芳香・消臭剤', '個'),
(235, '茶わん・皿・鉢', '個'),
(236, '茶飲料', '個'),
(237, '調理パン', '個'),
(238, '豆腐', '個'),
(239, '豆類', '個'),
(240, '豚肉', '個'),
(241, '酢', '個'),
(242, '鍋・やかん', '個'),
(243, '電子レンジ', '百円'),
(244, '電気冷蔵庫', '百円'),
(245, '電気掃除機', '百円'),
(246, '電気洗濯機', '百円'),
(247, '電球・ランプ', '個'),
(248, '風味調味料', '個'),
(249, '食パン', '個'),
(250, '食卓セット', '百円'),
(251, '食器戸棚', '百円'),
(252, '食塩', '個'),
(253, '食用油', '個'),
(254, '飲酒代', '個'),
(255, '魚介のつくだ煮', '個'),
(256, '魚介の漬物', '個'),
(257, '魚介の缶詰', '個'),
(258, '鶏肉', '個');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `units`
--
ALTER TABLE `units`
  ADD PRIMARY KEY (`id`),
  ADD KEY `variety` (`variety`) USING BTREE;

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `units`
--
ALTER TABLE `units`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=259;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
